// Tortoise and Hare.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include "pch.h"
#include <iostream>
#include <time.h>

using namespace std;

int main()
{
    cout << "Hello World!\n";
	srand((unsigned)time(NULL));
	Race race;
	race.path.printPath();
	cout << "|" << race.hare.get_energy() << "/" << race.tortoise.get_energy() << endl;
	int status = 0;

	while (status != 1) {
		status = race.update();
		if (status == 1) break;
		race.path.print_path();
		cout << "|" << race.hare.get_energy() << "/" << race.tortoise.get_energy() << endl;
	}
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
